[{"date":"January 01","title":"BEGIN WITH GOD","bibleVerse":"W","devotionalReading":"W\ne need to structure our lives by \nGod’s  standards  as  defined  in  \nHis  word.  If  you  ask  me  how  to  start  \nanything  in  the  world,  I  will  refer  to  \nthe  above  scripture  and  tell  you  that  \nif in the beginning God created, then \nit makes sense that in every beginning \nGod must be the focal point. He must \nlead  the  life  we  live.  He  must  be  first  \nand foremost.\nThe Hebrew word for beginning means \nfirst in place, time, order or rank, and \nspecifically  a  first  fruit.  It  also  means  \nchief  or  chiefest,  principal  thing.  So,  \nwhen the world was created, God was \nin  the  beginning.  He  existed  before  \nthe beginning and was responsible for \nthe beginning. This simply means that \nanytime the year begins the first person \nthat must come to the fore is God. He \nmust be the first in place, time, order \nor rank.\nThat is why it just makes sense to start \nthe year with God. It is very important \nto think of ways to begin the year with \nGod.  True  believers  begin  the  year  \nby  waiting  on  God  through  prayer,  \nfasting and reading of scriptures. This \nis  laudable.  Once  you  start  the  year  \nwith  God  with  the  various  spiritual  \nactivities,   you   are   sure   to   receive   \ndivine  creativity  and  blessing  in  your  \nlife the rest of the year. You may have \nmany plans, but it is still important to \npresent your plans to God in prayer. In \nfact, it is not unscriptural to sit down \nand  plan  your  life.  God  admonishes  \nus to plan. The word of God says that \n“The heart of man plans his way, but the \nLORD establishes his steps.” (Pro 16:9)\nHowever, when we plan it is the Lord \nthat will establish the steps we take to \nbring our plans to pass. That is why it \nis  needful  to  devote  some  time  in  the  \nfirst  few  weeks  or  even  the  whole  of  \nthe month of January to seek the face \nof  God.  Seeking  God’s  face  is  a  way  \nto  commit  your  plans  to  Him  as  the  \nfollowing scripture says; “Commit your \nway to the LORD; trust in him, and he \nwill act.” (Ps 37:5)\nIn the first month of the year, we teach \nfrom the scriptures that we should give \nGod  our  first  fruits  just  as  the  word  \n“beginning” means in the Hebrew. As \nwe  pray,  we  also  engage  in  applying  \nthe  principle  of  sowing  and  reaping  \nby giving God our first fruit, which is \nour first harvest of the year. This could \nmean your first salary of the year, your \nfirst  income  of  the  year,  your  first  \nprofit  of  the  year  etc.  In  Israel  it  was  \nthe harvest of the year (Heb. 10:35). \nWe  therefore  combine  prayer,  fasting  \nand  giving  as  a  way  to  seek  God’s  \nfavour for the new year.\n","prayerAndConfession":"Lord, I seek your favour for the New "},{"date":"January 01","title":"BEGIN WITH GOD","bibleVerse":"“In the beginning, God created the heavens and the earth”","devotionalReading":"“In the beginning, God created the heavens and the earth”\n(Gen. 1:1)\nBEGIN WITH GOD\n","prayerAndConfession":""}]