{"date":"January 10","title":"  ","devotionalMessage":"How would you feel if the President of  your  country  called  you  for  a  chat and you are seen taking a friendly walk   with   him   in   the   presidential   garden and around the court? Anyone who  sees  you  will  wonder  how  in  the  world you got this favour. To walk with the President? It feels good. Somehow some  favour  will  be  splashed  on  you  before  you  leave  his  presence.  Is  it  possible for man to walk with God? It surely is.In the above scripture we are told that Enoch  walked  with  God.  It  is  not  easy  to  explain  in  detail  how  Enoch  did  it.  We  will  try  an  explanation.  The  surprising  thing  about  Enoch’s  walk  with  God  is  that  he  was  not  found because God took him away. In other words, Enoch did not see death because  God  took  him  out  of  the  world. We can also walk with God. Let us study about Enoch in the scriptures. We are told that Enoch was a prophet and  prophesied  about  the  coming  of  our Lord Jesus Christ:“14And  Enoch  also,  the  seventh  from  Adam,   prophesied   of   these,   saying,   Behold,   the   Lord   cometh   with   ten   thousands   of   his   saints,   15To   execute   judgment  upon  all,  and  to  convince  all  that are ungodly among them of all their ungodly  deeds  which  they  have  ungodly  committed, and of all their hard speeches which   ungodly   sinners   have   spoken   against him.” (Jude 1:14-15)With  the  ability  to  prophesy  he  had  spiritual  insight.  He  had  abilities  to  see  visions  and  dreams.  However,  the  Bible  is  very  clear  about  the  precise  things  he  did  to  succeed  in  walking  with    God.    “By    faith    Enoch    was    translated  that  he  should  not  see  death;  and  was  not  found,  because  God  had  translated him: for before his translation he  had  this  testimony,  that  he  pleased  God.” (Heb. 11:5)Enoch  was  a  man  of  faith  too.  He  pleased God in his walk with Him. It means  he  did  things  that  made  God  happy.  If  he  was  a  man  of  faith  and  faith  comes  by  hearing  the  word  of  God (Rom. 10:17) then we can imply that  he  received  word  from  God  and  walked  in  accordance  with  the  word.  Since  faith  is  obedience,  we  can  also  infer  that  he  walked  in  obedience  to  the  word  of  God.  We  get  this  clue  from  Abraham,  a  man  of  faith  who  also  walked  with  God  by  faith:“By faith  Abraham,  when  he  was  called  to  go out into a place which he should after receive  for  an  inheritance,  obeyed;  and  he  went  out,  not  knowing  whither  he  went.” (Heb. 11:8)Therefore,  to  have  a  closer  walk  with  God you must have His word, believe His word and obey His word. Such is the life that pleases God.","prayer":"Lord.  I  want  to  walk  closer  to  you.  Help  me  Lord  to  know  more  of  your  word in Jesus’ name. Amen!A CLOSER WALK WITH GOD","bibleText":"“And Enoch walked with God: and he was not; for God took him\" ","verse":"(Gen. 5:24)"}