{"date":"January 01","title":"BEGIN WITH GOD","devotionalMessage":"We need to structure our lives by God’s  standards  as  defined  in  His  word.  If  you  ask  me  how  to  start  anything  in  the  world,  I  will  refer  to  the  above  scripture  and  tell  you  that  if in the beginning God created, then it makes sense that in every beginning God must be the focal point. He must lead  the  life  we  live.  He  must  be  first  and foremost.The Hebrew word for beginning means first in place, time, order or rank, and specifically  a  first  fruit.  It  also  means  chief  or  chiefest,  principal  thing.  So,  when the world was created, God was in  the  beginning.  He  existed  before  the beginning and was responsible for the beginning. This simply means that anytime the year begins the first person that must come to the fore is God. He must be the first in place, time, order or rank.That is why it just makes sense to start the year with God. It is very important to think of ways to begin the year with God.  True  believers  begin  the  year  by  waiting  on  God  through  prayer,  fasting and reading of scriptures. This is  laudable.  Once  you  start  the  year  with  God  with  the  various  spiritual  activities,   you   are   sure   to   receive   divine  creativity  and  blessing  in  your  life the rest of the year. You may have many plans, but it is still important to present your plans to God in prayer. In fact, it is not unscriptural to sit down and  plan  your  life.  God  admonishes  us to plan. The word of God says that “The heart of man plans his way, but the LORD establishes his steps.” (Pro 16:9)However, when we plan it is the Lord that will establish the steps we take to bring our plans to pass. That is why it is  needful  to  devote  some  time  in  the  first  few  weeks  or  even  the  whole  of  the month of January to seek the face of  God.  Seeking  God’s  face  is  a  way  to  commit  your  plans  to  Him  as  the  following scripture says; “Commit your way to the LORD; trust in him, and he will act.” (Ps 37:5)In the first month of the year, we teach from the scriptures that we should give God  our  first  fruits  just  as  the  word  “beginning” means in the Hebrew. As we  pray,  we  also  engage  in  applying  the  principle  of  sowing  and  reaping  by giving God our first fruit, which is our first harvest of the year. This could mean your first salary of the year, your first  income  of  the  year,  your  first  profit  of  the  year  etc.  In  Israel  it  was  the harvest of the year (Heb. 10:35). We  therefore  combine  prayer,  fasting  and  giving  as  a  way  to  seek  God’s  favour for the new year.","prayer":"Lord, I seek your favour for the New year in Jesus’ name.","bibleText":"“In the beginning, God created the heavens and the earth”","verse":"(Gen. 1:1)"}